Repository: Conar25/portfolio
Catalog: projects/locale/*/LC_MESSAGES/django.po
Languages: ru

source: The goal of this project is to visualize basic pathfinding algorithms. It uses javascript with d3js. You can check the code on <a href='https://github.com/ilshat25/path-finder' class="link">github</a> or visit the <a href='https://ilshat25.github.io/path-finder/' class="link">site</a> and try it yourself (no support for mobile devices yet).
ru: Цель этого проекта - визуализировать основные алгоритмы поиска пути с использованием javascript и библиотеки d3js. Вы можете посмотреть код на <a href='https://github.com/ilshat25/path-finder' class="link">github</a> или опробовать вживую посетив <a href='https://ilshat25.github.io/path-finder/' class="link">сайт</a> (пока нет поддержки для мобильных устройств).

source: Currently available algorithms:
ru: Доступные на данный момент алгоритмы:

source: Greedy BFS (manhattan and euclidean heuristics)
ru: Жадный BFS (манхэттенская и евклидова эвристики)

source: A* (manhattan and euclidean heuristics)
ru: A* (манхэттенская и евклидова эвристики)

source: Greedy BFS manhattan heuristic
ru: Жадный BFS манхэттенская эвристика

source: Greedy BFS euclidean heuristic
ru: Жадный BFS евклидова эвристика

source: A* manhattan heuristic
ru: A* манхэттенская эвристика

source: A* euclidean heuristic
ru: A* евклидова эвристика

source: This app allows you to maintain your to-do list. All you need is to authenticate using your social account (google and vk available). You can check the code on <a href='https://github.com/ilshat25/to-do-list' class="link">github</a> or visit the <a href='https://ilshat-to-do.herokuapp.com/items/' class="link">site</a> and try it yourself.
ru: Это приложение позволяет вам вести свой список дел. Все, что вам нужно, это пройти аутентификацию, используя свою учетную запись в социальной сети (доступны google и vk). Вы можете помотреть код на <a href='https://github.com/ilshat25/to-do-list' class="link"> github </a> или опробовать вживую посетив <a href = 'https: // ilshat-to-do.herokuapp.com/items/ 'class = "link"> сайт</a>.

source: Change account
ru: Смена пользователя

source: Your to-do list is related to social account you authenticate with. To change account just click on "Change account" linked on the bottom.
ru: Ваш список дел связан с социальной учетной записью, с которой вы аутентифицировались. Чтобы изменить учетную запись, просто нажмите на ссылку «Change account» внизу.

source: Rearrange to-do items
ru: Перестановка списка дел

source: You can rearrange to-do items by grabbing and moving them.
ru: Вы можете переставлять предметы в своем списке дел, для этого удерживайте и перемещайте их.

source: Search
ru: Поиск

source: My Projects
ru: Мои проекты

source: Search by tag or name...
ru: Искать по тэгу или названию...

source: No results...
ru: Ничего не найдено...
